<?php

// +----------------------------------------------------------------------
// | 验证码设置
// +----------------------------------------------------------------------

return [
    // 验证码类型
    'type'  => [
        // 登录配置
        'login' => [
            // 长度
            'length' => 6,
            // 过期时间 秒
            'expire' => 900
        ],
        // 注册配置
        'register' => [
            // 长度
            'length' => 6,
            // 过期时间 秒
            'expire' => 900
        ],
        // 修改密码
        'change-password' => [
            // 长度
            'length' => 6,
            // 过期时间 秒
            'expire' => 900
        ]
    ]
];
